[
  "NUEE DE SCORPIONS\n\n Une masse grouillante de scorpions menaçants émerge de l'obscurité et recouvre un des guerriers.",
  "SERPENTS\n\n Sans avertissement, des centaines de serpents tombent soudain du plafond par des trous soigneusement dissimulés. Chaque guerrier est rapidement recouvert par une masse grouillante de serpents venimeux. ",
  "PIEGE - FOSSE\n\n Lancez 1D6 pour chaque guerrier. Celui qui obtient le plus faible résultat tombe dans une fosse remplie de lances dressées.",
  "PIEGE - FLECHE EMPOISONNEE\n\n Lancez 1D6 pour chaque guerrier. Celui qui obtient le plus faible résultat a déclenché une flèche empoisonnée qui vient s'enfoncer dans son bras. ",
  "PIEGE - BLOC DE PIERRE\n\n Lancez 1 D6 pour chaque guerrier. Celui qui obtient le plus faible résultat a déclenché un piège. ",
  "PIEGE - SORT DE PARALYSIE\n\n Lancez 1D6 pour chaque guerrier. Celui qui obtient le plus faible ré résultat a déclenché un piège, et un éclair d'énergie jaillit du mur le plus proche et le paralyse pour 1D6 tours.",
  "PIEGE - GAZ EXPLOSIFS\n\n Lancez 1D6 pour chaque guerrier. Celui qui obtient le plus faible résultat a déclenché un piège et la pièce se remplit soudain de gaz.",
  "PIEGE - ARC ELECTRIQUE\n\n Lancez 1D6 pour chaque guerrier. Celui qui obtient le plus faible résultat a déclenché un piège, et un éclair aveuglant jaillit du plafond et l'atteint à la tête.",
  "HERSE\n\n Une fois que tous les guerriers sont entrés dans cette section de donjon, une herse s'abat derrière eux, leur coupant la retraite.",
  "MALEDICTION D'HASHAKK\n\n Alors que le dernier guerrier entre dans la pièce, une voix désincarnée s'élève et annonce froidement que les guerriers sont entrés dans les salles interdites et qu'ils doivent affronter la malédiction de Hashakk.  Un des guerriers (déterminé aléatoirement) est soudain assailli de tous les côtés par les esprits des seigneurs de ce royaume, morts depuis ",
  "PORTE SECRETE;\n\n Les yeux perçants d'un guerrier remarquent que les pierres du mur dissimulent habilement une porte secrète.",
  "Dud Door I\n\nThe players find a hidden door. It's painted bright pink and has hundreds of coloured lights and levers. Nothing can force it open, and clairvoyance, teleport etc don't work beyond it. If anyone pulls a lever, everyone within 10' gets a 1d8 electric shock and all the lights change color.\nAfterthought: The characters are being chased by a powerful monster and they wind up in a dead end with this door as the only way out. See how desperate they get to figure it out with the monster 15 seconds behind them.\n",
  "Dud Door II\n\nSomewhere in the dungeon the players find a locked door they can't force, pick, or whatever. Later the come across a large crystal key. If the key is placed in the lock, it is ripped from the character's grasp and swallowed by the door.\nAfterthought: The key then reappears wherever it was before.\n",
  "Invisible Bridge\n\nAn invisible bridge 1' wide and 50' long spans a deep chasm. The players have to:\n1) work out that it's there.\n2) convince themselves that it's there.\n3) work out a system of ropes etc to make sure no one falls. \nUse dex checks to determine chances of falling. Strong winds, hostile flying creatures, and a fear of heights could make this harder.\nAfterthought: There is a 3' long gap in the centre of the bridge, and if the players assume that it's solid all the way and walk over... The gap can be jumped easily once they know it's there.\n",
  "Appearing Bridge\n\nScenario similar to 'Invisible Bridge', except that the bridge isn't even there until someone tries to step on it. Then it appears, one foot at a time, and everyone can see it.\nAfterthought: The characters are being chased, and anyone running along the bridge will move faster than the blocks can appear, and fall. The blocks may disappear again behind the characters to stop the monster pursuing.\n",
  "Guard Route\n\nGuards patrol an area the characters must gain entry to. The guards are too nasty to fight and the party cannot risk raising the alarm.\nSolution: Sleep or charm spells\nImpersonate guard\nImpersonate high official and bluff\nKill a guard and take uniform\nInvisibility or fly\nDistraction\netc.\n",
  "Object on High Hook\n\nA valuable object (keys?) sits on a small hook 80' up an unclimbable wall. An anti-magic field surrounds the room.\nSolution: fire an arrow or throw something to knock the object off the hook.\nAfterthought: Object is fragile and someone must be standing ready to catch it.\n",
  "Sleeping Guards\n\nThe characters gain entry to a guardroom full of sleeping guards. They must kill the guards or sneak past them to gain an object.\nAfterthought: If any of the players speaks to another player (simulating character-character conversation) during this encounter, the guards wake.\n",
  "Pit with Trap Door\n\nThe first character falls into a pit trap for low damage. It's easy to get out again, but if they stop to search, they find a trapdoor to another area in the bottom of the pit.\n",
  "Archer Attack at Point-Blank\n\nThe party engages in combat with a few archers, who eventually scatter and run for it. The characters don't pursue, and later open a door to find one of the archers 2' behind it pointing a crossbow at his head for LOTS of damage.\nAfterthought: The archers are in fact scattered in ambush positions right through the dungeon. Hear noise will detect them on the other side of doors.\n",
  "Flammable Slime\n\nGooey green slime drips onto a character's head. It does no damage (the player doesn't know that), but tell the player that it's itching and stinging. The slime can be scraped off easily with a weapon. However, it is highly flammable and attempts to burn it off are likely to end in disaster.\nAfterthought: The players can collect the slime and make molotov cocktails (if acceptable recepticals can be found).\n",
  "Wounded Monster Seen Escaping\n\nThe party turns a corner to see a wounded monster slinking off. If the players follow, they lead into an ambush.\n",
  "Glory Device\n\nThe players find a statue of a fighter desperately trying to press the button in the centre of an amulet he's wearing. The amulet is not petrified and can be taken from the fighter (whose ghost later haunts them?). Pressing the button obliterates everything within 15' - the fighter knew he was going to die and was trying to take the monster with him.\nAfterthought: To be fair, you should give the players some kind of warning about the amulet rather than just killing them all off for experimenting. Perhaps a loud siren sounds the first time they press the button, and it explodes on the second?\n",
  "Statues Abound ... Medusa?\n\nThe players find serval statues scattered around a room. The door is closed, and they should get the hint from the statues that the have to open it with eyes shut and mirrors ready. If not, well, it's their own fault.\n",
  "Stone Block & Trap Door\n\nA 5' x 5' x 5' stone block in the corner of a room with an 11' ceiling. Stand on block, poke ceiling and find a trapdoor to another area. (This is a really old trick, so expect the players to find it).\nAfterthought: The block rises up after the characters, blocking the trapdoor and trapping them.\n",
  "Drink Me!\n\nThe characters enter a room containing a potion labelled 'drink me'. Searching the room will reveal a mousehole about 4' high.\nSolution: drink potion.But how is the character going to get back to full size ? \n ",
  "Riddling Statue\n\nA room containing a statue of a sage and no doors (the door the party entered by has disappeared). Teleport etc won't get them out of the room. The statue will answer any question with 'what' in it (such as 'What is the easiest way toget out of here ?'), even if the party did not intend it as a question. One in four answers are false, and the statue will answer a maximum of six questions.\nThe easiest way out is to ask the statue. If the characters waste their questions, they'll have to find another way.\n",
  "Bottomless Hole\n\nFor some reason (a bet? a spell?), the party has to find out whether a hole is bottomless or not. Easy. Drop something down and listen.\nAfterthought: If they watch it carefully, the party will find that the hole is slowly but steadily moving towards them. Anyone who falls in will probably never be recovered. The hole will chase them throughout the entire dungeon, which raises an interesting question: how do you kill a hole? You fill it in.\n",
  "Spkiy Mat with Object\n\nA 3' x 3' mat covered in long poisonous spikes. Stuck to the underside is a valuable object.\nAfterthought: The mat wakes up and starts chasing the characters.\nSolution: Flip the mat over with a polearm.\n",
  "Timebomb\n\nA room containing a 3' black sphere (a bomb), and a complicated timing device. It will explode and destroy some valuable treasure if the characters run. If they try to disarm it, either make an INT check or use this puzzle:\nAfterthought: The players take the bomb with them (by rolling it along the ground), and later reactivate it to destroy something.\n",
  "Equipment Must be Destroyed\n\nFor some reason (about to summon a monster?), equipment in a room must be destroyed quickly and completely.\n",
  "Capture Enemy Mage\n\nThe party enters a mage's sleeping quarters to find him asleep on a bunk. They can capture him and interrogate, but must beware of verbal-only spells and sudden escape attempts.\n",
  "Glass Ceiling\n\nStuck for a way to get out of the dungeon, the party enters a room with a glass dome 50' up for a ceiling. Through the glass they can see the sky.\nSolution: Smash glass and climb or fly up.\nAfterthought: Shards of falling glass do some damage if they didn't get out of the way in time.\n",
  "Dead Rat\n\nInside a treasure chest the characters find: a dead rat. Inside the rat is a 1000GP gem - and if they don't cut it open they'll never know.\n",
  "Killer Veggies\n\nA good trap to use if the group isn't cooperating. The first character in line opens a door to be grabbed by some strange vegetation. The victim will be digested in 30 seconds, and the only way to free them is for EVERY member of the group to assist in pulling them out.\n",
  "Scratches in Walls Near Lair\n\nObservant characters will spot long scratches on the walls. They should thus be prepared for a surprise attack by a wererat, or equivalent. If nobody commented on the scratches or what they could signify, the monsters automatically get surprise.\n",
  "Invisible Force Field\n\nA valuable item sits in the centre of the floor. If anyone tries to get near, they'll feel bars pushing against their chest and legs. Note that tall characters will NOT feel bars against their head, but you don't have to tell them this unless they ask. The bars are only 5' high, but it will take some experimenting to figure this out. Once they know, magic or a good jump should get them over.\nAfterthought: It could also be set up so that the bars are 8' tall, but only surround three sides of the item.\n",
  "Greed Trap I\n\nA 20'x10' room with a door at each end. The floor is covered with gold pieces. The party can take as many as they can carry.\nThe problem is, the gold is what's holding the floor down. The moment more than 150gp leaves the room (like when the first character leaves, and the others are still there), the floor will shoot up and slam them against the ceiling (or drop out from under them).\n",
  "Greed Trap II\n\nA gently sloping corridor 5' wide and 100' long. Darkened. Every 10 feet there is a valuable item of some sort. The slope gradually steepens and becomes slippery. After 60', the characters cannot get back up, and will slide into a deep pit at the end of the corridor.\nAfterthought: Roping the characters together will fix this problem. They could also try descending into the pit and finding the treasure left behind when previous people fell for this.\n",
  "Doppleganger\n\nOne of the adventurers (better make it an NPC, to be fair) is silently killed and their place taken by a doppleganger. The doppleganger has all the powers of the person it killed and will betray the group at a suitable moment.\n",
  "Humungus Fungus\n\nA 6'x6'x6' soft green lump in the centre of the room. Can climb over it - carefully - with no trouble. If it's punctured, spores do LOTS of damage.\nAfterthought: Several other, smaller, green lumps are seen throughout the dungeon. They gradually grow and multiply.\n",
  "Trapped Demon\n\nA demon trapped in a magic pentagram tries to persuade the characters to release it (promises gold, etc.). Upon release, the demon attempts to kill the party.\nAfterthought: If the character has knowledge of the creatures origin (perhaps a religion non-weapon proficiency), they may be able to guess the demon's intentions.\n",
  "Tall Room and a Bucket\n\nThe characters are in a very tall, but thin room. There is a trap door on the ceiling and a bucket of water sits in the corner. The walls cannot be climbed and spells are ineffective in the room. If the characters empty the bucket (spill, knock over, etc.), they notice that it magically refills.\nSolution: Keep emptying the bucket, fill the room and swim up.\n",
  "Controlled Player\n\nOne of the characters picks up a sword (or whatever), and is immediately controlled. The rest of the party must use unarmed combat to remove the weapon, without killing the controlled character.\n",
  "Rescue Prisoners\n\nThe party enters a jail of some sort. After killing the jailor, they rescue the prisoners. Some may be reliable, some could try to betray the characters.\nAfterthought: One of them is a lycanthrope. Or a vampire. Or a polymorphed evil mage.\n",
  "Good or Evil\n\nThe spies a band of orcs guarding three wounded people, but something doesn't feel right about the situation. A perceptive player will notice that all of the orcs are carrying ornate broadsword (uncommon for orcs), and the wounded humans are licking their wounds and snarling. The magic in the room is actually playing tricks on the players, and creating an illusion - The orcs are actually soldiers guarding three wounded orcs.\n",
  "Pictured Door\n\nAn enormous room is lined with large, heavy tapestries. One of the dozens of tapestries show a corridor, similar to the entrance. Surprise, the tapastries is actually a magical door.\n",
  "Dud Money\n\nA large bird is seen lying in the corner of a cave. Not far from the bird is a chest full of coins. Surprise, the coins are actually tiny eggs, with an illusion cast upon them. Attempting to pick up the 'coins' will shatter an egg and alert the large bird to the parties presense.\n",
  "Catch 22 Pit Trap\n\nA player character falls in a pit, taking standard falling damage and separating him from his comrades. In the pit are two levers. The first lever throws the player out of the traps with 3d6 dmg from the force of landing or hitting the ceiling. The other lever will let off a full fireball above the trapped player, getting his comrades.\n",
  "Teleporting Pit Trap\n\nWhen the player falls in he is teleported to a random location. If his companions follow, they might go to a different location.\nAfterthought: Good for separating parties. The same trap can be used in a doorway - A player walks through a doorway, unaware of the portal, and is teleported elsewhere. His comrades may attempt walking through (thinking they will end up in the same place as their friend), and end up in a different place.\n",
  "Egg Beater Trap\n\nUpon falling into the pit, the player notices three stone fists coming out of the walls. The fists attempt tograb the player once he's down, attempting to strip him of everything he is wearing, and give him several punches. The stone fists have a strength of 19 and 20 hitpoints. They are immune to fire and lightening. There are usually a lot of bones and treasure in the pit for those who are strong enough to take it.\n",
  "Delayed Trap\n\nThe trap isn't tripped until the third character passes, or waits one round before going off. For example, the last player enters a corridor - BANG! - the door shuts behind them - RUMBLE! RUMBLE! - suddenly a huge boulder starts rolling down the corridor behind them - RUN!!!\n",
  "Teleport Loop\n\nThe character enters a teleporter that teleports him to another teleport that teleports him back. The loop continues until a condition is met (usually a dispel magic is cast or a lever somewhere down the corridor is pulled). This will frazzle most players.\n",
  "Yellow Mold Death\n\nPicture a room with Yellow Mold covering the floor. The room is 50x50 and 30 feet high. On the ceiling are stalagtites. In reality they are piercers (see Monstrous Compendium). In the back of the room is a chest that is bolted to the floor, it is not covered by the mold. If the characters walk on the floor then the mold will go off. So most of the time they will choose to fly, or use ropes on the stalagtites. That is when the fun starts. When they get half way across the room the piercers start dropping. If they hit the fool who is flying then so be it. They will probably fall into the mold causing it to go off. But if the piercers miss, then they hit the mold. Very bad for the characters indeed.\n",
  "Handy Door\n\nUpon opening a door, have a large glowing fist slam into the lead character (2d10 damage - saving throw vs. death for half damage). Of course, even if he makes the roll, he's going to go flying through the air and hit the wall (1d6 Dex check for no damage). But, in order for your characters to truly appreciate this trap, you must explain that the hand then grabs the door knob and pulls the door shut behind it. Assuming the players have any brains, they should realize the trap just reset itself.\nSolution: You can allow a dispel spell, but that would take the fun out of it. Have the players knock. If you want to make it more difficult, have the players say a password.\n",
  "The Pedestal\n\nThe players stand in a large and featureless room, at the center of which is a pedestal holding a valueable item. There is a chimney-like hole in the ceiling above, but the player's can't see where it leads. When the item is touched, the cieling surround the pedestal begins to drop. \nIf the players react quick enough, they will move to the pedestal (since the chimney will provide safety from the crushing cieling). Now, trapped in the pedestal, area, the players notice there is no breeze. The pedestal area is air tight! \nThe players have only have about an hour max worth of air. Unless one of the characters is a mage, or has a magical device (teleport, transmute rock or mud) they are in big trouble.\nSolution: As mentioned, spells can be effective here. But, the valuable item that was found on the pedestal can also be used. Perhaps it is a rare device that the players must figure out - once the devices secrets are found, the trap resets and they can procede onward. Or maybe the valuable item can simply teleport them to another room.\nPerhaps the pedestal has a reset switch on it, but it should be difficult to find because all of the players are trapped in the small room.\n",
  "Mimic\n\nA mimic (se Monstrous Compendium) is a creature that disguises itself as an inanimate object to lures it's prey. It tends to disguise itself as treasure chests and banquet tables. Greater Mimics (see Monstrous Compendium Annual 2) have been said to disguise themselves as entire rooms (imagine seeing a doorway leading into a room full of treasure ... which is actually the creatures mouth, leading into it's stomach).\n",
  "Golems\n\nMany great magicians use golems and mechanical warriors to protect their lairs & treasures. Below are a list of man-made guards (and where they can be found):\nAutomaton, Scaladar (Monst. Comp. Annual 2)\nAutomaton, Triobrands (Monst. Comp. Annual 2)\nBurning Man Golem (Monst. Comp. Annual 2)\nClay Golem (Monstrous Comp. Vol. 1)\nCopper Automaton (Al-Qadim)\nFlesh Golem (Monstrous Comp. Vol. 1)\nHalf-Golem (Ravenloft)\nIron Golem (Monstrous Comp. Vol. 1)\nLightning Golem (Forgot. Realms)\nMagma Golem (Darksun)\nMechanical Golem (Ravenloft)\nPhantom Flyer Golem (Monst. Comp. Annual 2)\nSalt Golem (Darksun)\nStone Golem (Monstrous Comp. Vol. 1)\n",
  "Summon Dragon\n\nThe players open the door to the room to see a huge skeleton crammed into a 10'x10' room, in the middle of the room is the shattered but complete skeleton of a man holding a device in his hand. If anyone has the necessary knowledge, the huge skeleton can be identified as a dragon.\nAfterthought: It would be down to the GM as to the specifics of the device, how many charges are on it, whether it still works, how it is triggered etc. The device itself summons the dragon immediately and permanently (or else the man would have left the room before it arrived, and the dragon would no longer be in the room if not permanent) so I would suggest the the device not confer any control over the dragon to the user, which in itself could be a second nasty surprise for them.\nYou could add the bodies of several attackers which had prompted the human to use his new found device in self defense, perhaps not knowing what it actually did.\nSolution: The device in the humans hand is actually a device which summons a dragon. The human made a mistake in using it in a confined space and was crushed by the dragon, which itself died, unable to move in such a small space. This isn't really a trap as such, more a puzzle, a wary character would walk through this situation without any troubles.\n",
  "Look Up\n\nThe players come across a bottle with a message in it. The message says look up. Players who fail to think of the consequences for their actions will be harmed in some way - when they look up, various bad things can happen. An archer suspended from the cieling fires off a called shot head; or a trap with a three second delay goes off, hitting the player in the face (rock, goo, mother-in-law, ect.); a beast is dropped from above.\nAfterthought: Could very well kill most wounded or low level characters. Mainly the curious ones. Also a good strategy for setting amushes.\n",
  "Fighters' Nightmare\n\nBehind a heavy, locked, and possibly trapped door is giant stone pit (100' x 100'). There is a series of holes cut into the wall directly underneat the door which forms a crude ladder. In the center of the room sits a pedestal with a huge gem atop it (or maybe it's a book on a wooden pedestal, or an ancient skeleton wrapped in a cloak sitting on an ivory throne--anything non-metal that whets the party's interest). Of course the fun begins when a character tries to move the gem (or whatever). At that point secret doors on the four walls open and four (or more) ravenously hungry rust monsters come running out. They are unable to climb out of the pit, but they should be able to ruin the day of any fighter in the pit when the doors open.\nAfterthought: The treasure in the center of the room is trapped, casting a powerful paralyze spell as soon as it is touched. The treasure might also be worthless.\nSolution: Use telekenesis to move the treasure. Of course spells may not work in the room. In that case, only one party member needs to enter the pit, then only his armor and weapons get destroyed. Of course a party who sends its members off on its own (even when all members are still in sight of each other) is more likely to be split up.\n",
  "The Gargoyle Trap\n\nThe character's enter a room, with gargoyle statues lined along the walls. One of the characters steps on a trigger device, activating the trap. The doors suddenly shut and the gargoyle statues open their mouths, spitting streams of water into the room. The room begins to flood.\nAfterthought: Attempting to destroy the statues only results to a pile of rubble, and a spout that continues to fill the room. Attempting to plug this spout is futile, becuase the pressure is too strong (and there are several other spouts filling the room as well).\nSolution: A simple search, DC 20 will reveal a trap door, upon opening this trap door, all the water goes in it and the room is dry again, but how the hell do we get out of the room???\n",
  "Snake Room\n\nThe players enter a room with a pedestal in the center, and lots of circular holes in the walls and roof, in the pedestal lies a gem, more specificaly a giant diamond worth 5,000 gp. the pedestal is in the center of a pentagram in the floor. When the characters grab the gem nothing happens, but when they remove it from the pentagram, the doors shut, and from the holes fall hundreds of snakes.\nAfterthought: Snakes are weak, and there is an antitoxin in the next room, but they can't continue until they have killed all of the snakes.\nPoison: Fort Save DC 22\nInitial Damage: 1D6 Constitution (temporary)\nSecondary Damage: 2D6 Constitution (temporary)\n",
  "Perspective's End\n\nA long hallway of about twenty feet which ends with a doorway. The doorway is actually an illusion and merely a wall. The hallway may start at about 10' x 10', but it grows smaller. The look of it gives the illusion of perspective when moving down the hallway, but instead of looking as if it gets smaller (as all hallways do), it truly does get smaller. At the end, the hallway is 3' x 3'.\nAfterthought: This might lead heroes to an untimely end if being pursued, the hallway cramming them into a small space for an easy mark.\n",
  "Clone Wars\n\nYou and your party walk into a room filled with mirrors. Suddenly, you hear an evil laugh as the images upon the mirrors come to life! Now there are clones for every character. This fight will not be easy, since you can not tell the differnce between the real character and the clone.\nAfterthought: The clones have the same looks and powers of their look-a-like, and even some of the same habit raits. Characters may have more than one clone. That is, if your really up for a challenge. (clones have a rank total of 20 bluff)\nSolution: You may make a charisma/bluff check to see if it's your friend or foe.\n",
  "Wall Of Illusion\n\nWhen you and your party walks through a certain doorway, you are immediatly teleported to the entrance of the dungeon.\nAfterthought: If you go back to that doorway a second time, the door will not be there. In it's place will be a solid wall. If a player walks through the wall (it's just an illusion anyway) they will NOT be transported to the dungeon entrance ... instead, they will enter a room containing some treasure.\nSolution: Travel back through the dungeon.\n",
  "n\nLying in the middle of the dark hall lies a corpse. Next to the corpse are two empty pouches and a journal rests in its arms. The journal is written in an ancient elven language. The journal reads, I write quickly, for he is coming.The ghost will not take me withour a fight.However, I fear I am lost.I have found it 's only weakness, but lack the compo... it' s cut off with dark red blood stains.\nSolution: Make a check to see if you can read the text beneath the blood stains(Read DC 15 - Elf Lang).Success makes out the word components. The party may decipher that a spell needs to be cast(components is the first hint.The empty pouches are a second hint).An intelligence check at this point may lead to the following.  The person had found this ghosts weakness - magic. Unfortunately for this individual, he had no spell components left and died in his fight.\n",
  "Key Rings\n\nIn a tray are about 100 rings, all cheap looking. There is no door in this room after you enter, only a like large keyhole on the far wall. (Thieves who might want to try and pick the lock need make a DC 60 or be put to sleep for 24 hours - unwakable sleep). Also in the room is a foot long tapered stick. Hmmm, what to do ... A more thorough (sp?) search of the ring tray reveals that 7 of the rings aren't just gold or silver bands, but have different jewels on them.\nAfterthought: This is a good puzzle to start off a puzzled themed adventure, it gets players into a mindset that will help them solve puzzles.\nSolution: The rings are of different sizes, and will fit on the stick in a specific order. Then you can take your key ring (or your stick of rings) and open the lock, which reveals an exit.\n",
  "Treasure Chest of Doom\n\nAn elaborate chest sits in the center of a room. Standing directly in front of the chest triggers the pressure plate at its base, springing the would be thief against the far wall, which is actually an illusionary wall. The thief travels about ten feet further, smacking into a real wall and dropping into a 50ft chasm with some spikes at the bottom. Hitting the wall triggered oil to fall atop the thief and a few seconds later a flame arrow fires down the chasm into the spikes and the oil covered thief.\nAfterthought: You can add poison to the spikes if you want to further damage the thief.\nSolution: Reflex saves abound, this trap is designed for a high level rogue who needs to be humbled.\n",
  "The Shifting Transparent Labyrinth\n\nYour adventures are trailing behind their mark as he disappears in a cave. Upon entering the cave they see a long corridor with eventually engulfs all light.\nAs they venture deeper and deeper. They emerge form the long tunnel into the edge of a huge room. In the center of room they see a shining object on a pedestal.\nIf they venture forward they smash into an invisible wall of some kind stops them. (Stone wall augmentation - Transparency). They can only go left or right. They will choose either direction. This is when the fun begins. As they progress through the labyrinth they will be constantly banging in the walls (no damage - except for a sore nose, until they learn to walk with their hands in font of them.) As they are walking parts of the wall are constantly shifting positions. If you want to instigate a bit of panic, at some point one of the wall shifts could cut party members off form on another. The rest is up to you.\nAfterthought: What about their mark you ask? If the party had turned around and looked up, when they first got into the edge of the cave, they might have seen a small dark hole in the ceiling. This leads to the marks hiding spot. This can be as simple or as complex as you want, but a main room with 2-3 other smaller rooms should do the trick. Remember that behind on of the doors will be their mark and who knows what else!\nSolution: Smear something on the walls or scorch with fire. The goo or the charcoal will stick and be visible\n",
  "Legless Door\n\nThe door out of this coridoor has no lock, door knob etc. Although, at the top and bottom it has metal pannels. This door is clearly meant to be broken through. When the door is kicked through, the top metal pannel reveals its true form which is a guilotine - it falls down and severs the characters leg. If the player charges through the door, ramming it with his shoulder, then more dire consequences can result.\nAfterthought: There may be body parts strewn around the door, and blood stains ... anything suggesting the danger. (perhaps, when the door is broken through, it magically repairs itself, so the door resets the trap)\nSolution: As breaking through the door can cause serious injure, and permanent damage, an alternative solution may be found. Use a spell to break through. Find another way around. Con an npc to attempt to break down the door (possible evil action). A regeneraltion spell may heal chopped-off limbs.\n",
  "Jewel Dust\n\nAs the players approach a door (untrapped and unimportant), the players hear something shatter on the other side. When the door is opened, the players see the floor of this new chamber covered in a multi-colored sand-like substance. Intelligent characters may realise that the sand is actually crushed jewels - worthless, unless the players can find some eccentric mage or jeweller interested in them. In addition to this, one side of the room is pockmarked with about a hundred small holes, about the size of a ring.\nBy the time players have taken all this in - and they probably still haven't moved into the room - sparkling objects have begun to shoot from the holes and crash into the opposite wall, creating more puffs of the sand. Unknown to the players, but most likely assumed, the 'sparkling objects' are of course gems ... but gems that are cut to be very sharp and happen to be flying from the wall at a considerable speed! Any attempts to catch or stop the gems before they are destroyed will result in nasty gouges, and even well armoured characters may suffer wounds as there is no way of discovering from which holes the gems will come from. After a wound has been taken, a gem can be recovered though (each worth about 1000 - 2000 gp) and if players specify that they are 'avoiding the missiles/gems' the room can be crossed safely (with a successful dexterity check).\nAfterthought: Maybe the jewel dust, rather than being worthless, could help players blind or poison a creature later on.\nSolution: This doesn't need to be solved; greed may lead to injuries but careful characters can pass safely.\n",
  "Issues Creature\n\nThe players open a door and see a large monster. This creature is limited only by the DM's imagination; it could be a dragon, a giant minotaur, a golem - it doesn't really matter. The creature will act offensively, yelling or roaring (think things like 'You're gonna die!' or even just 'Die!') and may raise weapons or rear back in anticipation of a strike. But all is not as it seems. The creature is fully real and alive, but the nature of this room is very strange. As soon as you enter the chamber, you can thrash and kick and swipe all you like, but within the dimensions of this room combat is prevented. You simply cannot make contact with any other any creature! This can have thousands of uses, and is particularly useful for cowardly characters who flee from encounters.\nAfterthought: Maybe archers shooting from outside the room could still damage those within.\nSolution: A powerful dispel magic might be able to remove the charm, but unless someone in the room has a great treasure there's really no need. Of course, the big introduction with the creature is unneccessary if you can come up with something better.\n",
  "Giant Hoax\n\nThe party finds a giant bear trap (or other enlarged trapping device). As bait there is some treasure - if the party is on the run, make sure that the treasure is something they want. Well, rogues will inspect the trap. Tell them that they don't find anything that suggests the trap would work. Mages will then cast spells to see if magic is involved. Tell them they've found nothing. By this time any pursuing monsters will have caught up, and the party will have to make a quick decision; do they risk a nasty fate or sacrifice the riches?\nAfterthought: This trick will definitely have to be used on the run, otherwise the party might waste too much time trying to figure it out.\nSolution: Well, the bear trap is fully UNoperation, and there's no enchantments involved. It's just a model of a bear trap! This trick will reward gutsy characters.\n",
  "Antigrav Tunnel\n\nThe party is climbing up a chute, preferably in an area that has been high in magical references. There's no sign of danger, you tell the party that they can relax... then suddenly whoever is leading the climb is yanked from the wall and somehow manages to be falling upward!\nThe next few characters in line are meant to be a bit scared. If their personalities are particularly cautious chances, then they may not proceed at all. But apart from a possibly painful landing, the falling leader simply tumbles down from the roof of a new room entirely. When you think about it, that must mean that this new set of rooms is built upside down, but the freak of magic that is reversing gravity still means that the new rooms can be explored normally. In any case, chances are that the party may spend a while working it out.\nAfterthought: This fortress is definitely owned by a powerful wizard. There's no way anyone else could have created something so confusing!\nSolution: If there is something powerful and evil hiding in the second set of rooms a powerful dispel magic could bring their perfect world crashing down! Danger for the mage below, however, would still be high.\n",
  "Prickly Lock\n\nThis is a simple trick to fool a low level rogue, or perhaps a non-rogue who is just trying his hand at lockpicking.\nTell the party that they are approaching a door with what appears to be a complicated lock, then specify to the rogue that though the lock is fancy, he thinks it will be simple to pick. Unbeknown to the poor rogue, the lock has two catches, each with its own DC ... and the lock is in fact incredible complicated!\nThe two DC's are 15 and 25-30. If the rogue passes the first one he has managed to turn the first catch - the false catch. So the rogue has his hands close up to the lock, and he turns his pick, and from small holes all around the key hole poisonous needles stab out, one or two at a time in an unpredicable fashion. The poison is of your choice, but as the rogue is meant to be low level don't make it anything too potent.\nAfterthought: This was based on a small line from the Dungeon Master's Guide. Perhaps if the rogue is very, very inexperienced you could make the needles longer rather than poisonous. This way a few stabs will make his fingers sore enough to prevent him from lock picking, but otherwise he'll be fine.\nSolution: As each needle stabs out, they can be broken off with a crushing weapon. Only when all the needles are broken can the rogue or another character make a second attempt on the second DC.\n",
  "Ring of the Stab\n\nPlayers find a very thick and chunky ring - it's about half an inch thick and fits very akwardly on the finger. A fat ruby sits in the centre of it, and the ring is accompanied by a simple, roughly scrawled note:\n'While wearing ring, think of injury location, press ruby HARD!'\nPlayers will most likely keep the ring until one of them is hurt, and then the ruby will be pushed. The ruby is actually attached to a very thick and pointy spike, which when pushed will break through the weak inside of the ring and stab into the poor injured person who is wearing it. Then the poison that was sitting inside the metal band can pour into a freshly opened wound and enter the bloodstream.\nAfterthought: This is a very nasty little trick, and though it may seem a little 'unreal' it is actually very possible. It's just a hollow band, filled with poison, with a weak underside and a spiked ruby. (I never said it would be common, just very possible!) This ring can even easily fool high level characters, especially if the note also specifies that it might only have one charge left. A minor charm of no significance might also have been cast on the gem, so that if a detect magic is cast the ring will appear to be enchanted.\nSolution: Don't push the ruby.\n",
  "Trusting Stab\n\nPlayers find an elaborately carved altar, with a very intricate fleur-de-lis swirls and elvish symbols (as opposed to a darker design of thorns and skulls). Engraved somewhere nearby are the words:\n'If thy wishes to make a wish,\nA sacrifise I demand.\nTake the dagger, slit thy throat,\nEnter the sacred land.'\nA beautiful shell dagger lies on the altar ... a dagger stained with blood. Despite the calm and welcoming design, there are also a few blood stains on the floor around the altar.\nIt's a simple setup - a few words and some pretty carvings, with no wish spell or sacred land. So will a member of the party be stupid enough to kill themselves? Statistics show results may vary.\nAfterthought: If you want to make the trap nastier then perhaps whoever created it cleans it up after each use. Cancel the bloodstains, make the altar even more inviting by saying it has crystals inset in it's top, have a spell of no consequence over the area to throw off detect magics... it all comes down to how trusting the party is.\nSolution: Just pass on by. A detect magic will show there's nothing going on and the adventure can continue.\n",
  "The Never-Ending Corridor\n\nPlayers enter through a non-descript wooden door that has no magical qualities about it. Once the players have past through the doorway and have begun to walk down the corridor they will find that they are getting no closer to the end (even though the door always appears to be 100 meters away) and if they look over their shoulders they will find that they are not getting any further from the entry door, no matter how fast or for how long they run. If they turn around and walk towards the entry door, they will find that they can still not get any closer.\nAfterthought: It would be interesting to see the players enter the corridor while being chased by a monster. They monster would not be able to attack them but to escape they must walk backwards TOWARD the moster. Fighting a monster over your shoulder would be very hard indeed.\nSolution: Simply walk backwards. Players may look over their shoulders but if at any point they turn and walk directly towards the door, they will again be stuck fast.\n",
  "Here but for the Grace of God\n\nIn a plain, low-lit room, players find a large obsidian mirror (obsidian being a highly reflective Volcanic rock). The mirror, however, does not reflect the players images as a normal mirror dose. If touched, the magic mirror will transport players to a different plane of existance, an Opposite World.\nThe rest is up to the DM's imagination. The players could find themselves as a different sex, race, alignment or class. (A neutral evil, male dwarf Warrior suddenly becomes a lawful good, Female Elf magic user!) Poisons could become healing potions! There are no limits as to what could happen!\nSolution: Simply retouch the mirror. However, if this solution is to easy, then the mirror may have moved to a different location, or players may have to find a completely differnt mirror(made of White Diamond?).\n",
  "Letter Pattern\n\nThe party finds an old, stone door - not of dwarven design, but of humans. Above the door seven letters are carved boldly in the human script:\nW I T N L I T\nAccompaning the door is a statue of a human, fairly poorly carved. When the party approaches it speaks.\nWHAT IS THE NEXT LETTER IN THIS SEQUENCE ? \nFrench: Q E L P L D C\n Quelle est la prochaine lettre de cette série ?\nThe statue will take one answer from each party member. If noone can answer the statue then the door will remain firmly shut.\nAfterthought: The fact that the door and statue were human made hints that the puzzle may not have the usual dwarven depth and cunning. The 'riddle' is a very simple letter puzzle - each is the starting letter of a word in the question the statue asked. The next letter is 's'.\nSolution: If players just begin to guess letters and by chance stumble upon the correct one, you can have the statue ask why. If they cannot tell you the correct method then they still cannot pass.\n",
  "Voodoo Dungeon\n\nAfter players have fought their way through a fairly earth-based or magical dungeon they come across a small chamber with an intricate sculpture in the middle. You can pass the players a sketch of the winding shapes portrayed on this sculpture, and if they have been keeping an accurate map then the mystery of the carving will be revealed - the sculpture is a three dimensional map of the dungeon.\nThe sculpture is built on a raised board that reaches waste height on a human. Players can easily mainpulate the walls, doors or other features in the mock-up dungeon... but powerful, dark magic is attached to the board. If the players destroy a wall, the wall collapses elsewhere in the dungeon. If the players flick down a door, a door explodes somewhere else. Powerful voodoo magic is at work, and let Pelor help the fool who tries to destroy the entire board.\nAfterthought: The board is only a threat to party if they collapse any area that leads to the exit or any room a party member is in. Used appropriately, the sculpture can be used to destroy doors the party was unable to unlock or have the party gain access into entirely new areas.\nSolution: The magic used to create the sculpture was of a dark kind. Perhaps the DM could tell any clerics that they have a bad feeling about the board, leading to the suggestion it should be destroyed...\nIf the players realise how they can use board the dungeon can become their plaything. It is fair to say that that room is the 'heart' of the dungeon - don't let the party find it too easily.\n",
  "Acid Arrow Trap",
  "Acid Spray",
  "Arrow Blaster",
  "Arrow Trap",
  "Barbed Net Trap",
  "Basic Arrow Trap",
  "Built-to-Collapse Wall",
  "Burning Hands Trap",
  "Camouflaged Pit Trap",
  "Ceiling Pendulum",
  "Chain Flail",
  "Compacting Room",
  "Deeper Pit Trap",
  "Earthmaw Trap",
  "Electrified Floortile",
  "Extended Bane Trap",
  "Falling Block",
  "Fire Spray",
  "Fire Trap",
  "Flame Strike Trap",
  "Flamethrower",
  "Fusillade of Darts",
  "Fusillade of Spears",
  "Ghoul Touch Trap",
  "Glyph of Warding (Blast)",
  "Greater Acid Spray",
  "Guillotine Blade",
  "Hail of Needles",
  "Heavy Chain Flail",
  "Ice Dart Trap",
  "Ice Spear Trap",
  "Idol of Chaos",
  "Idol of Evil",
  "Idol of Law",
  "Large Electrified Floortile",
  "Lightning Bolt Trap",
  "Magic Missle Trap",
  "Net Trap",
  "Pit Trap",
  "Poison Dart Trap",
  "Poisoned Arrow Trap",
  "Poisoned Guillotine Blade",
  "Poisoned Net Trap",
  "Portcullis Trap",
  "Rolling Rock Trap",
  "Rune of Confusion",
  "Rune of Dread",
  "Rune of Fear",
  "Rune of Hypnosis",
  "Rune of Paralyzation",
  "Scythe Blade",
  "Scything Blade Trap",
  "Shrine of Chaos",
  "Shrine of Evil",
  "Shrine of Law",
  "Spear Trap",
  "Spiked Blocks from Ceiling",
  "Spiked Pit Trap (100 ft. Deep)",
  "Spiked Pit Trap",
  "Stone Blocks from Ceiling",
  "Swinging Block Trap",
  "Symbol of Hypnosis",
  "Symbol of Panic",
  "Teleporter Crystal",
  "Thunder Blaster",
  "Thunderstone Mine",
  "Thunderstone Mine",
  "Wall Blade Trap",
  "Whirling Poison Blades",
  "Wide-Mouth Pit Trap",
  "Wyvern Arrow Trap"

]
